#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-EwS9KRMqx3FMSYrD

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.acm_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:542829616420:certificate/097367e4-2010-4451-a33d-1342a26cb702]
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
aws_route53_zone.philward_io_zone: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_route53domains_registered_domain.philward_io_domain: Refreshing state... [id=philward.io]
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
data.aws_route53_zone.philward_io_zone: Reading...
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_route53_zone.philward_io_zone: Read complete after 1s [id=Z003529526RCV8G5J1PS7]
aws_route53_record.acm_validation_record["philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]
aws_route53_record.root_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_resume.philward.io_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.acm_certificate must be replaced
+/- resource "aws_acm_certificate" "acm_certificate" {
      ~ arn                       = "arn:aws:acm:us-east-1:542829616420:certificate/097367e4-2010-4451-a33d-1342a26cb702" -> (known after apply)
      ~ domain_name               = "philward.io" -> "*.philward.io" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "philward.io"
              - resource_record_name  = "_c88ce6dbd651a4d32d84f8a6aa562e90.philward.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_b84c77fccaa6319b23f86bc1f842402c.dhzvlrndnj.acm-validations.aws."
            },
            # (1 unchanged element hidden)
        ]
      ~ id                        = "arn:aws:acm:us-east-1:542829616420:certificate/097367e4-2010-4451-a33d-1342a26cb702" -> (known after apply)
      ~ not_after                 = "2023-10-06T23:59:59Z" -> (known after apply)
      ~ not_before                = "2022-09-07T00:00:00Z" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.philward.io",
          - "philward.io",
        ]
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (1 unchanged attribute hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
      ~ aliases                        = [
          + "resume.philward.io",
        ]
        id                             = "E5CPX462LFNKX"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          - cloudfront_default_certificate = true -> null
          + ssl_support_method             = "sni-only"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_route53_record.acm_validation_record["*.philward.io"] will be created
  + resource "aws_route53_record" "acm_validation_record" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z003529526RCV8G5J1PS7"
    }

  # aws_route53_record.acm_validation_record["philward.io"] will be destroyed
  # (because key ["philward.io"] is not in for_each map)
  - resource "aws_route53_record" "acm_validation_record" {
      - allow_overwrite = true -> null
      - fqdn            = "_c88ce6dbd651a4d32d84f8a6aa562e90.philward.io" -> null
      - id              = "Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME" -> null
      - name            = "_c88ce6dbd651a4d32d84f8a6aa562e90.philward.io" -> null
      - records         = [
          - "_b84c77fccaa6319b23f86bc1f842402c.dhzvlrndnj.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z003529526RCV8G5J1PS7" -> null
    }

Plan: 2 to add, 1 to change, 2 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*